<template>
    <div class="chronology-item">
        <div class="title">
            <h2>ДИВЕЕВСКИЙ РАЙОН</h2>
            <h2>в 50х-80х годах</h2>
        </div>
        <div class="date date-1">
            <span>1950</span>
            <p>И в послевоенный период основой основ жизни района являлось сельское хозяйство. В колхозном производстве была занята подавляющая часть дивеевского населения.
                Интересы, нужды, успехи и трудности крестьянского труда были интересами, нуждами, успехами и трудностями всего района. В 1956 году начала свою работу инкубаторно-птицеводческая станция. С 1954 года действует Сатисский мясокомбинат.</p>
        </div>
        <div class="date date-2">
            <span>1960</span>
            <p>С 1 января 1965 года Дивеевский район вновь восстановлен в старых границах. С января 1967 года колхозы района перешли на денежную оплату труда.
С первой половины 1960-х годов колхозы начали активно применять для заправки полей химические удобрения. Зимой 1963 года на базе районной инкубаторно-птицеводческой станции была создана Дивеевская межколхозная птицефабрика.
В 1967 году в рай о не открылся механический завод - филиал горьковского завода «Гидромаш».</p>
        </div>
        <div class="date date-3">
            <span>1970</span>
            <p>В стране проводилась политика концентрации сельского населения в меньшем числе крупных населенных пунктов. Реализовывалась она путем деления всех сельских поселений на «перспективные» и «неперспективные». В результате такого подхода прекратили свое существование многие села и деревни Нечерноземья.
                В декабре 1972 года в районе было создано межколхозное лесничество, хозяйство которого состояло из принадлежавших колхозам лесных массивов.</p>
        </div>
        <div class="date date-4">
            <span>1980</span>
            <p>В новой политической обстановке, которая начала складываться с 1985 года, происходит серьезная переоценка деятельности компартии на протяжении всего периода се существования. Однако отрицать ту роль, которую играла партия в жизни страны, не приходится.</p>
        </div>
    </div>
</template>

<style>
    .chronology-item{
        background: url('/chronology-bg.png') center center / cover no-repeat;
        width: 100%;
        height: 1301rem;
        padding: 273rem 0;
        position: relative;

        .title{
            background-color: var(--black);
            padding: 25rem 30rem 15rem 100rem;
            width: 652rem;
            height: 147rem;
            clip-path: polygon(0 0,100% 0,100% 0, calc(100% - 60rem) 100%,0 100%,0 5rem);
            display: flex;
            flex-direction: column;
            justify-content: space-between;
        }

        h2{
            font-family: var(--font-durik);
            font-size: 48rem;
            text-transform: uppercase;
            line-height: 52.8rem;
            color: var(--white);
        }
        h2:nth-child(1){
            margin-left: 45rem;
        }
        
        .date{
            position: absolute;
            span{
                display: block;
                font-family: var(--font-durik);
                font-size: 128rem;
                line-height: 140.8rem;
                color: var(--orange); 
            }
            p{
                font-size: 18rem;
                line-height: 21.78rem;
                width: 551rem;
            }
        }

        .date-1{
            left: 100rem;
            top: 520rem;
        }

        .date-2{
            left: 684rem;
            top: 280rem;
        }

        .date-3{
            left: 1269rem;
            top: 280rem;
        }

        .date-4{
            left: 830rem;
            top: 750rem;
            p{
                width: 991rem;
            }
        }
    }
</style>