<script setup lang="ts">
import { AppRoutes } from '@/app/providers/index.js'
import ArchiveItem from './ArchiveItem.vue'
import CollectionItem from './CollectionItem.vue';
import MainSlider from './MainSlider.vue';
import BottomItem from './BottomItem.vue';
import ChronologyItem from './ChronologyItem.vue';
import TopItem from './TopItem.vue';

// заглушки
const epochData = [
	{
		name: 'название',
		photo: '/temp-epoch.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'название',
		photo: '/temp-epoch.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'название',
		photo: '/temp-epoch.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'название',
		photo: '/temp-epoch.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'название',
		photo: '/temp-epoch.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	}
]

const personData = [
	{
		name: 'ФИО',
		photo: '/temp-person.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'ФИО',
		photo: '/temp-person.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'ФИО',
		photo: '/temp-person.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'ФИО',
		photo: '/temp-person.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'ФИО',
		photo: '/temp-person.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	},
	{
		name: 'ФИО',
		photo: '/temp-person.png',
		description: 'Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высокотехнологичная концепция общественного уклада позволяет выполнить важные задания по разработке укрепления моральных ценностей.'
	}
]
</script>

<template>
	<div class="home">
		<div class="container">
			<TopItem />
			<ChronologyItem id="chronology"/>
			<ArchiveItem id="archive"/>
			<CollectionItem id="collection"/>
			<MainSlider title="Быт эпохи" :slides="epochData" :isCompact="true" id="epoch"/>
			<MainSlider title="Персоналии" :slides="personData" :isCompact="false" id="person"/>
			<BottomItem />
		</div>
	</div>
</template>

<style lang="scss" scoped></style>
